Extensions/src/InformationRegisters/AzRyНапоминанияПользователя/AzRyНапоминанияПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="281804bc-92a6-4ecf-ba3e-f9df86d13e5e">
  <name>AzRyНапоминанияПользователя</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="48f9c20c-db20-4a73-a582-4b75a82d55a1">
    <name>ВремяСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="08fd23e5-214e-40fd-81af-f737e3b8664c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7106a8fd-cbff-4d1a-a0d1-d6aa54d0d224">
    <name>Автор2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="f995cf7c-8fc1-497a-a9e7-a5c95f9e651d">
    <name>СтатусНапоминания</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="23b30069-f9fc-4c3d-87cd-c7476d84b401">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3a4d81cc-ca0e-4435-acfa-28eb8a442652">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e8f11a95-508b-47a2-a724-b27e3fa194c4">
    <name>Источник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/CommonModules/AzRyОбсужденияГлобальный/Module.bsl
// Открывает форму текущих напоминаний пользователя.
//
Процедура AzRyПроверитьТекущиеОбсуждения() Экспорт
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента();
	ИнтервалПроверкиНапоминаний = ПараметрыРаботыКлиента.AzRyНастройкиНапоминаний.ИнтервалПроверкиНапоминаний;
	
	ТаблицаОповещений = AzRyОбсужденияВызовСервера.ПолучитьОбсужденияТекущегоПользователя();
	ИнтервалСледующейПроверки = ИнтервалПроверкиНапоминаний * 60;
	
	Если ТаблицаОповещений.Количество() > 0 Тогда
		Для каждого ТекСтрока Из ТаблицаОповещений Цикл
			
			Если ТекСтрока.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения") Тогда
				Текст = "საჭიროა საწყობზე მიღების დადასტურება!";
				Картинка = БиблиотекаКартинок.ЗолотойШар;
			ИначеЕсли ТекСтрока.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеОдобрено") Тогда
				Текст = "საწყობზე მიღება დადასტურებულია!";
				Картинка = БиблиотекаКартинок.ЗеленыйШар;
			ИначеЕсли ТекСтрока.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено") Тогда
				Текст = "საწყობზე მიღება უარყოფილია!";	
				Картинка = БиблиотекаКартинок.КрасныйШар;
			КонецЕсли; 
			
			//НапоминанияПользователяКлиент.ОткрытьФормуОповещения();		
			//ОсновнаяОрганизация = ПредопределенноеЗначение("Справочник.Организации.ОсновнаяОрганизация");
			//НавигационнаяСслыка = ПолучитьНавигационнуюСсылку(ОсновнаяОрганизация);
			ПоказатьОповещениеПользователя(Текст, "e1cib/list/РегистрСведений.AzRyНапоминанияПользователя",
											"გამომგზავნი: " + ТекСтрока.Отправитель, Картинка, СтатусОповещенияПользователя.Важное, ТекСтрока.ПредставлениеИсточника + "_" + Строка(ТекСтрока.Отправитель));
		
		КонецЦикла;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("AzRyПроверитьТекущиеОбсуждения", ИнтервалСледующейПроверки, Истина);
	
КонецПроцедуры
